Tekla Open API Reference for Tekla Structures 2025
SymbolInfo.SymbolFile Property
 Gets or sets the symbol file. E.g. "xsteel".
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SymbolFile { get; set; }
Public Property SymbolFile As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SymbolInfo Class
Tekla.Structures.Drawing Namespace